Data setler ile calismayi ögreniyorum

-> Titanic yolcu listesi ile ne bok yapicam bilmiyorum ama planlarim; ölenlerin Listesi, hayatta kalanlarin listesi. Yolcularin yas ortalamasi,ölenlerin, Hayatta kalanlarin, hayatta kalma ihtimali kacti cart curt.

In [75]:
import pandas as pd 

titanic_list = pd.read_csv("titanic.csv")


titanic_list

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [37]:
#Isim, yas  ve cabin listesi ;
titanic_Name_Age = pd.read_csv("titanic.csv",usecols= [5, 3, 4], index_col= False)


titanic_Name_Age

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
886                              Montvila, Rev. Juozas    male  27.0
887                       Graham, Miss. Margaret Edith  female  19.0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN
889                              Behr, Mr. Karl Howell    male  26.0
890                                Dooley, Mr. Patrick    male  32.0

[891 rows x 3 columns]

In [38]:
titanic_list.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [44]:
titanic_list.iat[3, 3]

#spesifik cell in degerini veriyo hmmmmmm

'Futrelle, Mrs. Jacques Heath (Lily May Peel)'

In [53]:
titanic_list[['Name', 'Age', "Sex"]]

                                                  Name   Age     Sex
0                              Braund, Mr. Owen Harris  22.0    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                               Heikkinen, Miss. Laina  26.0  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                             Allen, Mr. William Henry  35.0    male
..                                                 ...   ...     ...
886                              Montvila, Rev. Juozas  27.0    male
887                       Graham, Miss. Margaret Edith  19.0  female
888           Johnston, Miss. Catherine Helen "Carrie"   NaN  female
889                              Behr, Mr. Karl Howell  26.0    male
890                                Dooley, Mr. Patrick  32.0    male

[891 rows x 3 columns]

In [52]:
#yolcularin yas ortlamasi
titanic_list[["Age"]].mean().astype(int)

Age    29
dtype: int64

In [64]:
# Erkeklerin ve kadinlarin yas ortalamasi ? 

boys = titanic_list[titanic_list["Sex"]== "male"]

girls = titanic_list[titanic_list["Sex"]== "female"]

In [65]:
#kadin yolcularin yas ortalamasi 

girls["Age"].mean().astype(int)

27

In [66]:
#erkek yolcularin yas ortalamasi 

boys["Age"].mean().astype(int)

30

In [76]:
# ded or not check ? -> nasil yapicagimi bilmiyorum
titanic_list.iat[1, 1]

#bunu beceremicem, next

1

In [80]:
#survive edenlerin liste
not_dead = titanic_list.where(titanic_list["Survived"] > 0)

In [84]:
#Hayatta kalanlarin yas ortalamsi 

not_dead["Age"].mean().astype(int)

28